In [32]:
import pandas as pd

In [33]:
import numpy as np

In [34]:
s1 = np.random.randint(10,size = 5)
s2 = np.random.randint(10,size = 5)
s3 = np.random.randint(10,size = 5)

In [35]:
sozluk = {"var1" : s1, "var2" : s2, "var3" : s3}

In [36]:
df = pd.DataFrame(sozluk)
df

   var1  var2  var3
0     1     8     4
1     9     9     8
2     1     6     1
3     3     1     9
4     7     0     5

In [37]:
df.index = ["a","b","c","d","e"]
df

   var1  var2  var3
a     1     8     4
b     9     9     8
c     1     6     1
d     3     1     9
e     7     0     5

In [38]:
df

   var1  var2  var3
a     1     8     4
b     9     9     8
c     1     6     1
d     3     1     9
e     7     0     5

In [39]:
l = ["c","e"]

In [40]:
df.drop(l,axis = 0)

   var1  var2  var3
a     1     8     4
b     9     9     8
d     3     1     9

In [41]:
"var1" in df

True

In [42]:
cl = ["var1","var4","var2","var3","var6"]

In [44]:
for i in cl:
    print(i in df)

True
False
True
True
False

In [46]:
df["var4"] = df["var1"]/df["var2"]
df

   var1  var2  var3      var4
a     1     8     4  0.125000
b     9     9     8  1.000000
c     1     6     1  0.166667
d     3     1     9  3.000000
e     7     0     5       inf

In [47]:
df.drop("var4", axis = 1, inplace = True)

In [48]:
df

   var1  var2  var3
a     1     8     4
b     9     9     8
c     1     6     1
d     3     1     9
e     7     0     5